{
  "architectures": ["BertForSeq2SeqTranslation"],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 101,
  "decoder_start_token_id": 101,
  "directionality": "bidi",
  "early_stopping": true,
  "eos_token_id": 102,
  "finetuning_task": "shimaore-french-translation",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 512,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "length_penalty": 1.2,
  "max_length": 256,
  "max_position_embeddings": 512,
  "min_length": 1,
  "model_type": "bert-seq2seq",
  "no_repeat_ngram_size": 3,
  "num_attention_heads": 8,
  "num_beams": 5,
  "num_hidden_layers": 6,
  "num_return_sequences": 1,
  "output_attentions": false,
  "output_hidden_states": false,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "repetition_penalty": 1.3,
  "source_language": "shi",
  "target_language": "fr",
  "temperature": 1.0,
  "top_k": 50,
  "top_p": 0.92,
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 32128,
  "model_version": "2.1.4",
  "training_corpus": "shimaore_french_parallel_v3",
  "dataset_size": 12847,
  "bleu_score_dev": 38.72,
  "bleu_score_test": 36.95,
  "chrF_score": 52.14,
  "training_epochs": 45,
  "best_epoch": 41,
  "framework": "pytorch"
}
