{
  "bos_token": {
    "content": "[CLS]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "cls_token": {
    "content": "[CLS]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "eos_token": {
    "content": "[SEP]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "mask_token": {
    "content": "[MASK]",
    "single_word": false,
    "lstrip": true,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "pad_token": {
    "content": "[PAD]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "sep_token": {
    "content": "[SEP]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  },
  "unk_token": {
    "content": "[UNK]",
    "single_word": false,
    "lstrip": false,
    "rstrip": false,
    "normalized": false,
    "special": true
  }
}
